Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: If you confuse them, we will presume that you are either evil or clueless.
es: Si los confunde, supondremos que usted es malvado o limitado.

source: If you copy a subroutine from one package to another, C<SUPER> resolution will be done based on the original package.
es: Si se copia una subrutina de un paquete en otro, la resolución de C<SUPER> se basará en el paquete original.

source: If you define an C<AUTOLOAD> in your class, then Perl will call your C<AUTOLOAD> to handle the C<DESTROY> method.
es: Si define C<AUTOLOAD> en la clase, Perl llamará a su método C<AUTOLOAD> para controlar el método C<DESTROY>.

source: If you do have a compiler, C<Mouse> will use it to compile some of its code for a speed boost.
es: Si dispone de compilador, C<Mouse> lo usará para compilar parte de su código o bien para aumentar la velocidad.

source: If you do not wish to install the L<Module::Starter|Module::Starter> package from CPAN, F<h2xs> is an older tool, originally intended for the development of XS modules, which comes packaged with the Perl distribution.
es: Si no desea instalar el paquete L<Module::Starter|Module::Starter> de CPAN, puede usar F<h2xs>, una herramienta más antigua que se creó originalmente para desarrollar módulos XS, y que se incluye en la distribución de Perl.

source: If you do so, we recommend that you follow the built-in semantics described below.
es: Si lo hace, le recomendamos que siga la semántica predefinida que se describe a continuación.

source: If you do so, you may actually have occasion to use the C</u> modifier explictly if there are a few regular expressions where you do want full Unicode rules (but even here, it's best if everything were under feature C<"unicode_strings">, along with the C<use re '/aa'>).
es: Si lo hace así puede, realmente, tener la oportunidad de utilizar el modificador C</u> de forma explícita si hay algunas expresiones regulares para las que desea aplicar todas las reglas de Unicode (pero incluso en este caso, es mejor usar la característica C<"unicode_strings">, junto con C<use re '/aa'>).

source: If you do this, you can't accidentally forget to decode or encode anymore, on things that use the layered handle.
es: Si hace esto, no se olvidará de volver a descodificar o codificar cosas que usan el identificador de archivo con una capa.

source: If you do want to export a bunch of symbols, use the C<%EXPORT_TAGS> and define a standard export set - look at L<Exporter> for more details.
es: Si desea exportar un conjunto de símbolos, use C<%EXPORT_TAGS> y defina un conjunto de exportación definido. Encontrará más detalles en L<Exporter>.

source: If you don't understand these concepts yet, please read L<perlintro> first.
es: De no ser así, lea primero L<perlintro>.

source: If you don't know what one of these is, the rest of this document isn't going to be much use to you.
es: Si no sabe lo que es un módulo Perl, este documento no le va a ser de gran ayuda.

source: If you don't run the full test suite, at least C<make test_porting>.
es: Si no ejecuta toda la batería de pruebas, ejecute al menos C<make test_porting>.

source: If you don't see a certain project listed at L<http://lists.perl.org>, check the particular website for that project.
es: Si no ve un proyecto determinado en L<http://lists.perl.org>, visite el sitio web específico del proyecto.

source: If you don't see an error message, you have the module.
es: Si no aparece un mensaje de error, significa que ya tiene el módulo instalado.

source: If you don't want this to happen, you can begin
es: Si no desea que ocurra esto, puede comenzar

source: If you evaluate a hash in scalar context, it returns false if the hash is empty.
es: Si se evalúa un hash en contexto de escalar, devuelve falso si el hash está vacío.

source: If you evaluate an array in scalar context, it returns the length of the array.
es: Si se evalúa un array en contexto de escalar, el valor devuelto es la longitud del array

source: If you feel the urge to write Perl modules, L<perlnewmod> will give you good advice.
es: Si desea escribir módulos de Perl, L<perlnewmod> le ayudará a empezar.

source: If you go with C<Moose>, it comes with its own role implementation.
es: Si se decanta por C<Moose>, podrá disponer de su implementación de roles.

source: If you have Perl installed locally, you probably have the documentation installed as well: type C<perldoc perl> in a terminal or L<view online|http://perldoc.perl.org/perl.html>.
es: Si ha instalado Perl localmente, es probable que también haya instalado la documentación: escriba C<perldoc perl> en el terminal. Como alternativa, puede L<consultar la documentación en línea|http://perldoc.perl.org/perl.html>.

source: If you have a burning desire to tell the world about your release, post an announcement to the moderated C<comp.lang.perl.announce> newsgroup.
es: Si está impaciente por dar a conocer su módulo, publique un anuncio en el grupo de noticias moderado C<comp.lang.perl.announce>.

source: If you have a library that provides an API, you can make any component of it available as just another Perl function or variable using a Perl extension written in C or C++ and dynamically linked into your main perl interpreter.
es: Si tiene una biblioteca que proporciona una API, puede hacer que cualquier componente de la misma esté disponible como cualquier otra función o variable de Perl mediante una extensión programada en C o C++, y vinculada dinámicamente al intérprete perl principal.

source: If you have a really hairy regular expression, use the C</x> modifier and put in some whitespace to make it look a little less like line noise.
es: En el caso de una expresión regular muy compleja, debe usar el modificador C</x> y poner algunos espacios en blanco para evitar que parezca un galimatías.

source: If you have any suggested changes for this page, let me know.
es: Si tiene alguna sugerencia relativa a esta página, le agradecería que me lo comunicara.

source: If you have cached your return value, then return a pointer to it without changing the reference count.
es: Si almacenó en caché el valor devuelto, debe devolver un puntero a dicho valor sin cambiar el contador de referencias.

source: If you have never been to a hackathon, here are a few basic things you need to know before attending: have a working laptop and know how to use it; check out the involved projects beforehand; have the necessary version control client; and bring backup equipment (an extra LAN cable, additional power strips, etc.) because someone will forget.
es: Si nunca ha estado en un I<hackathon>, debe saber algunas cosas básicas antes de asistir: necesita un ordenador portátil operativo y saber cómo usarlo; antes de acudir debe haber echado un vistazo a los proyectos en los que va a trabajar; necesita un cliente de control de versiones; y debería llevar material de repuesto (un cable LAN adicional, una regleta de alimentación adicional, etc.), ya que siempre habrá alguien a quien se le olvide algo.

source: If you have received a patch file generated using the above section, you should try out the patch.
es: Si recibe un parche generado siguiendo los pasos descritos en la sección anterior, debe probarlo.

source: If you have to communicate with things that are too liberal, you may have to use C.
es: Sin embargo, si tiene que comunicarse con algo que es demasiado liberal, puede que tenga que utilizar C.

source: If you have to communicate with things that aren't so liberal, you may want to consider using C.
es: Si tiene que comunicarse con algo que no es tan liberal, es posible que sea mejor utilizar C.

source: If you have to do anything with the number of bytes, it's probably best to move that part to step 3, just after you've encoded the string.
es: Si necesita el número de bytes para algo, debe calcularlo en el paso 3, después de codificar la cadena.

source: If you haven't read L<perlhack> yet, go do that first!
es: Si todavía no ha leído L<perlhack>, es lo primero que debe hacer.

source: If you haven't used regular expressions before, a quick-start introduction is available in L<perlrequick>, and a longer tutorial introduction is available in L<perlretut>.
es: Si nunca ha utilizado expresiones regulares, puede leer antes una introducción rápida en L<perlrequick> y un tutorial más detallado en L<perlretut>.

source: If you just want to know how to use the utilities described here, F<pod2usage> will just extract the "USAGE" section; some of the utilities will automatically call F<pod2usage> on themselves when you call them with C<-help>.
es: Si sólo quiere saber cómo se usan las utilidades aquí descritas, F<pod2usage> solo extraerá la sección "USAGE" (USO); algunas de estas utilidades llamarán automáticamente a F<pod2usage> si las llama con el modificador C<-help>.

source: If you make any changes that affect miniperl or core routines that have different code paths for miniperl, be sure to run C<make minitest>.
es: Si hace cambios que afecten a rutinas de miniperl o del núcleo que tienen rutas de código distintas para miniperl, asegúrese de ejecutar C<make minitest>.

source: If you need non-ASCII characters in your source code, make it a UTF-8 encoded file and C<use utf8>.
es: Si necesita utilizar caracteres que no pertenezcan a ASCII en el código fuente, codifíquelos como UTF-8 y use el pragma C<use utf8>.

source: If you need to C<die>, say C<croak> instead.
es: Asimismo, si el código incluye C<die>, debe usar C<croak> en su lugar.

source: If you need to install your software on a system without a compiler, or if having I<any> dependencies is a problem, then C<Moose> may not be right for you.
es: Si tiene que instalar el software en un sistema sin compilador, o si las dependencias suponen un problema, entonces C<Moose> podría no ser la solución adecuada.

source: If you need to maintain such code, you should read L<perlobj> to understand exactly how Perl's built-in OO works.
es: Si necesita mantener este tipo de código, debería leer L<perlobj> para comprender exactamente cómo funciona la orientación a objetos ofrecida por Perl.

source: If you need to set the encoding for STDIN, STDOUT, and STDERR, for example based on the user's locale, C<use open>.
es: Si necesita establecer la codificación para STDIN, STDOUT y STDERR basándose, por ejemplo, en la configuración regional del usuario, use el pragma C<use open>.

source: If you need to store multiple values or complex structures, you should serialise them, for example with C<pack>.
es: Si necesita almacenar varios valores o estructuras complejas, debe serializarlas (por ejemplo, con C<pack>).

source: If you need to use a typeglob to save away a filehandle, do it this way:
es: Si tiene que usar un typeglob para guardar un identificador de archivo, hágalo de esta manera:

source: If you needed to know the length of the string in bytes, now's the perfect time for that.
es: Si necesita averiguar la longitud de la cadena en bytes, ahora es el momento de hacerlo.

source: If you omit it, git will open a text editor for you to compose the message interactively.
es: Si la omite, git abrirá un editor de texto para que redacte el mensaje de forma interactiva.

source: If you only have one reference to an object stored in a lexical scalar, the object is destroyed when that scalar goes out of scope.
es: Si sólo dispone de una referencia a un objeto almacenada en una variable escalar léxica, se destruirá el objeto cuando se salga del ámbito de la variable escalar.

source: If you only want to cancel some uncommitted edits, you can use C<git checkout> and give it a list of files to be reverted, or C<git checkout -f> to revert them all.
es: Si sólo desea cancelar algunos cambios sin confirmar, puede usar C<git checkout> con una lista de archivos que hay que revertir, o C<git checkout -f> para revertirlos todos.

source: If you or your team can be faster, better, and stronger through Perl, you'll deliver more value.
es: Si con Perl usted y su equipo pueden desarrollar de manera más rápida y mejor, su productividad aumentará.

source: If you properly encode your strings for output, none of this is of your concern, and you can just C<eval> dumped data as always.
es: Si codifica correctamente las cadenas para la salida, no tiene que preocuparse por esto, y puede aplicar C<eval> a los datos volcados, como siempre.

source: If you re-run C<git status>, you should see something like this:
es: Si vuelve a ejecutar C<git status>, verá algo parecido a lo siguiente:

source: If you read this file _as_is_, just ignore the funny characters you see.
es: Puede leer este archivo en cualquier editor de texto (verá algunos caracteres extraños, pero puede ignorarlos).

source: If you require more flexibility than F<Porting/bisect.pl> has to offer, you'll need to run C<git bisect> yourself.
es: Si necesita más flexibilidad que la que ofrece F<Porting/bisect.pl> tendrá que usar C<git bisect> directamente.

source: If you run into resistance, figure out what those people get out of the other choice and how Perl might satisfy that requirement.
es: Si le oponen resistencia, averigüe qué necesitan y hágales ver en qué medida Perl podría cubrir sus necesidades.

source: If you simply want to check that a variable contains an object reference, we recommend that you use C<defined blessed($object)>, since C<ref> returns true values for all references, not just objects.
es: Si únicamente desea comprobar si una variable contiene una referencia a un objeto, se recomienda el uso de C<defined blessed($objeto)>, ya que C<ref> devuelve verdadero para todas las referencias, no solo para los objetos.

source: If you still need commercial support L<ActiveState|http://www.activestate.com/activeperl> offers this.
es: Si de todos modos necesita soporte comercial, L<ActiveState|http://www.activestate.com/activeperl> lo ofrece.

source: If you store the object in a package global, that object may not go out of scope until the program exits.
es: Si almacena el objeto en una variable global de paquete, es posible que no se salga del ámbito del objeto hasta que finalice el programa.

source: If you submit a patch, you should add your name to this file as part of the patch.
es: Si envía un parche, debe agregar su nombre a este archivo como parte del parche.

source: If you try C<Moose> and find that one of these issues is preventing you from using C<Moose>, we encourage you to consider L<Mouse> next.
es: Si prueba C<Moose> y encuentra que algunas de estas características impiden su uso, le recomendamos entonces el uso de L<Mouse>.

source: If you use one of them, you should never have to access the object as a hash directly.
es: Si usa cualquiera de ellos, no tendrá que acceder directamente al hash.

source: If you use the empty C<< E<lt>E<gt> >> operator, L</ARGV> is the name of both the L</filehandle> used to traverse the arguments and the L</scalar> containing the name of the current input file.
es: Si usa el operador C<< E<lt>E<gt> >> vacío, L</ARGV> es el nombre tanto del L</identificador de archivo> que se usa para recorrer los argumentos como del L</escalar> que contiene el nombre del archivo de entrada actual.

source: If you used WinZip, this was already done for you.
es: Si utilizó WinZip, ya estará desempaquetado.

source: If you want it connected to the rest of the CPAN, you'll need to go to "Register Namespace" on PAUSE.
es: Si desea conectarlo con el resto de CPAN, tendrá que registrar el espacio de nombres a través de "Register Namespace" en PAUSE.

source: If you want a plain text file, try http://www.cpan.org/misc/lwall-quotes.txt.gz .
es: Si prefiere un archivo de texto simple, puede descargarlo desde http://www.cpan.org/misc/lwall-quotes.txt.gz .

source: If you want either "-" or "]" itself to be a member of a class, put it at the start of the list (possibly after a "^"), or escape it with a backslash.
es: Si desea incluir el carácter "-" o "]" en una clase, debe ponerlos al principio de la lista (o a continuación de un signo "^"), o marcarlos con una barra diagonal inversa de escape.

source: If you want it to match the minimum number of times possible, follow the quantifier with a "?".
es: Si desea que coincida el menor número de veces posible, debe agregar al cuantificador un signo "?".

source: If you want objects to actually I<be> opaque you need to arrange for that yourself.
es: Si desea que los objetos I<sean> realmente opacos debe conseguirlo por sí mismo.

source: If you want to CLONE all objects you will need to keep track of them per package.
es: Si desea ejecutar C<CLONE> sobre todos los objetos tendrá que hacer un seguimiento de los objetos correspondientes a cada paquete.

source: If you want to alias only a particular variable or subroutine, assign a reference instead:
es: Si desea crear un alias de una sola variable o subrutina específica, debe asignar una referencia:

source: If you want to cancel one or several commits, you can use C<git reset>.
es: Si desea cancelar una o varias confirmaciones, puede usar C<git reset>.

source: If you want to delete your temporary branch, you may do so with:
es: Si desea eliminar su rama temporal, puede hacerlo con el siguiente comando:

source: If you want to detect the global destruction phase on older versions of Perl, you can use the C<Devel::GlobalDestruction> module on CPAN.
es: Si desea detectar si el programa está en la fase de destrucción global en versiones anteriores de Perl, puede usar el módulo C<Devel::GlobalDestruction>, disponible en CPAN.

source: If you want to do something when the object is destroyed, you can define a C<DESTROY> method in your class.
es: Si desea realizar alguna tarea específica en el momento de destruir el objeto, puede definir un método C<DESTROY> en la clase.

source: If you want to know how Perl OO works under the hood, the L<perlobj> document explains the nitty gritty details.
es: Si desea conocer el funcionamiento interno de la orientación a objetos en Perl, este documento explica los detalles esenciales.

source: If you want to know whether a particular scalar refers to an object, you can use the C<blessed> function exported by L<Scalar::Util>, which is shipped with the Perl core.
es: Si desea averiguar si una variable escalar concreta hace referencia a un objeto, puede usar la función C<blessed> exportada por L<Scalar::Util> (que forma parte del núcleo de Perl).

source: If you want to learn more about Perl 6, or have a desire to help in the crusade to make Perl a better place then read the Perl 6 developers page at http://dev.perl.org/perl6/ and get involved.
es: Si desea obtener más información sobre Perl 6 o ayudar en la cruzada para mejorar Perl, visite la página para desarrolladores de Perl 6 en http://dev.perl.org/perl6/ y anímese a participar en el proyecto.

source: If you want to learn the basics of Perl, you might start with the Llama book, which assumes that you already know a little about programming:
es: Si desea aprender los conceptos básicos de Perl, puede empezar por el Libro de la Llama, cuya lectura requiere unos conocimientos mínimos de programación:

source: If you want to rebase a personal topic branch, you will have to delete your existing topic branch and push as a new version of it.
es: Si desea reorganizar una rama puntual personal tendrá que eliminar la rama puntual existente y enviarla como una nueva versión de la misma.

source: If you want to run a threaded Perl on OpenBSD 3.7 or higher, you will need to upgrade to at least Perl 5.8.7.
es: Si desea ejecutar una versión de Perl compatible con hilos de ejecución en OpenBSD 3.7 o posterior, tendrá que actualizar a Perl 5.8.7 como mínimo.

source: If you want to search for the commit that I<solved> some bug, you have to negate your test case (i.e. exit with C<1> if OK and C<0> if not) and still mark the lower bound as C<good> and the upper as C<bad>.
es: Si desea buscar la confirmación que I<solucionó> algún error, debe negar el caso de prueba (es decir, salir devolviendo C<1> si el resultado es correcto y C<0> en caso contrario) y marcar el límite inferior como C<correcto> y el superior como C<incorrecto>.

source: If you want to use Perl on the Hurd, I recommend using the Debian GNU/Hurd distribution ( see http://www.debian.org/ ), even if an official, stable release has not yet been made.
es: Si desea usar Perl en Hurd, la distribución recomendada es Debian GNU/Hurd (visite http://www.debian.org/ ), aunque aún no existe una versión oficial estable.

source: If you're hacking on the Perl core, this will help you find what you're looking for.
es: En él encontrará toda la información necesaria para «hackear» el núcleo de Perl.

source: If you're already familiar with these terms, you should still skim this section, since it explains each concept in terms of Perl's OO implementation.
es: Aunque ya esté familiarizado con estos conceptos, debería leer por encima esta sección, puesto que explica cada concepto en términos de la implementación de la orientación a objetos de Perl.

source: If you're confused about why you use an '@' there on a hash slice instead of a '%', think of it like this.
es: Si se está preguntando por qué se usa un signo '@' en una porción de hash en lugar de un signo '%', piense en esto:

source: If you're going to open and close several different files in succession, it's fine to open each of them with the same filehandle, so you don't have to write out separate code to process each file.
es: Si va a abrir y cerrar varios archivos seguidos, puede usar el mismo identificador para abrir los distintos archivos; no tiene que escribir código de apertura para cada archivo.

source: If you're just looking to write some object-oriented code of your own, you are probably better served by using one of the object systems from CPAN described in L<perlootut>.
es: Si solo tiene que escribir código orientado a objetos, lo más recomendable es usar alguno de los sistemas de programación orientada a objetos disponibles en CPAN y descritos en L<perlootut>.

source: If you're looking for an introduction to object-oriented programming in Perl, please see L<perlootut>.
es: Si busca una introducción a la programación orientada a objetos en Perl, consulte L<perlootut>.

source: If you're looking for the information on how to use here-documents, which used to be here, that's been moved to L<perlop/Quote and Quote-like Operators>.
es: Si busca información acerca de cómo usar documentos incrustados, que solía estar en este documento, debe saber que ahora se encuentra en la sección "Comillas y operadores de comillas" de L<perlop>.

source: If you're looking to write your own object system, or you need to maintain code which implements objects from scratch then this document will help you understand exactly how Perl does object orientation.
es: Si desea escribir su propio sistema de orientación a objetos o tiene que mantener código que implementa objetos desde cero, este documento le ayudará a entender exactamente cómo funciona la orientación a objetos en Perl.

source: If you're new to Perl, you should start by running C<perldoc perlintro>, which is a general intro for beginners and provides some background to help you navigate the rest of Perl's extensive documentation.
es: Si nunca ha programado en Perl, debe empezar por ejecutar C<perldoc perlintro> para leer una introducción general para principiantes y aprender a orientarse por la amplia documentación de Perl.
